print("Добро пожаловаь в консольный калькулятор")
print('Здесь вы можете проводить сложение, вычитание, умножение. деление и возведение в степень')

username = input('Как к вам можно обращаться: ')
print(username, "Приветствую в нашем калькуляторе!")
act = input("Введите что вы хотите сделать(+,-,*,/,**): ")
if act not in ["+", "-", "*", "/", "**"]:
    print("Ошибка, Введите один из предоставленых символов!")
    while act not in ["+", "-", "*", "/", "**"]:
        act = input("Введите что вы хотите сделать(+,-,*,/,**): ")

while True:
    try:
        num1 = int(input("Введите первое число: "))
        num2 = int(input("Введите второе число: "))
        break
    except ValueError:
        print("Ошибка! Вводите ТОЛЬКО числа.")
res = 0

res = int(res)
num1 = int(num1)
num2 = int(num2)

if act == "+":
    res = num1 + num2
    print("Результат сложения:", res)

elif act == "-":
    res = num1 - num2
    print("Результат вычитания: ", res)

elif act == "*":
    res = num1 * num2
    print("Результат умножения: ", res)

elif act == "/":
    while num2 == 0:
        num2 = int(input("Введите другое значение для второго числа, на ноль делить нельзя: "))
    res = num1 / num2 
    print("Результат деления: ", res)

elif act == "**":
    res = num1 ** num2 
    print("Результат возведения в степень: ", res)
    
elif act != "+, -, *, /, **":
    print("Ошибка, Введите один из предоставленых символов!")





